package cw_07;

public class ArrayIterates {
    public static void main(String[] args) {
        int[] arr = {1, 2, 4, 12, 4};

        for (int i = 0; i < arr.length; i++) {
            System.out.println(arr[i]);
        }

//        1. Создать массив и заполнить его 10 элементами
//        2. Вывести массив в консоль в прямом порядке
//        3. Вывести массив в консоль в обратном порядке
//        4. Вывести в консоль первую половину массива
//        5. Вывести в консоль вторую половину массива
//        6. Вывести в консоль первую половину массива в обратном порядке
//        7. Подсчитать сумму элементов массива

    }
}

